export default function TermsOfServicePage() {
  return (
    <article className="mx-4 my-8 *:my-4">
      <h1 className="text-xl text-center">利用規約</h1>
      <section>
        <p>
          　この規約（以下「本規約」といいます。）は、とぴ（以下「運営者」といいます。）が提供するTRPG用創作イラスト投稿サイト「AStoryer
          -あすとりや-」〔https://astoryer.com〕（以下「本サービス」といいます。）を利用する全てのユーザー（以下「ユーザー」といいます。）に適用されます。ユーザーは、本規約をよくお読みいただき、同意の上、本規約に従って本サービスをご利用ください。
        </p>
      </section>
      <section>
        <h2 className="font-bold my-2">第1条（適用）</h2>
        <ol className="list-decimal ml-4">
          <li>
            本規約は、ユーザーと運営者との間の本サービスの利用に関わる一切の行為に適用されるものとします。
          </li>
          <li>
            運営者は、本サービスに関し、本規約のほか、ご利用にあたってのルール等、各種の規定（以下「個別規定」といい、本規約と個別規定を併せて「本規約等」といいます。）を定めることがあります。これらの個別規定は、その名称にかかわらず、本規約の一部を構成するものとします。
          </li>
          <li>
            本規約の定めが個別規定の定めと矛盾する場合は、特段の定めのない限り、個別規定の定めが優先されるものとします。
          </li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">第２条（本サービスの内容）</h2>
        <ol className="list-decimal ml-4">
          <li>
            本サービスは、運営者が、ユーザーに対し、TRPG用の創作イラストのアップロード（以下「投稿」といいます。）及び編集、並びに、投稿されたイラストやユーザーページの閲覧（以下「閲覧」といいます。）の機会を提供するサービスです。ただし、投稿については、第３条の利用登録が完了したユーザー（以下「登録ユーザー」といいます。）のみが利用できます。
          </li>
          <li>
            ユーザーは、本サービスの利用に関する一切の事項について責任を負うものとし、運営者は、ユーザー間で生じるトラブル、紛争、クレーム等（以下「トラブル等」といいます。）につき一切責任を負いません。ただし、運営者が本サービスの円滑な運営のために必要であると判断した場合は、トラブル等に関し、その報告を求め、助言を行うなど、必要な措置を講じることができるものとします。
          </li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">第３条（利用登録）</h2>
        <ol className="list-decimal ml-4">
          <li>
            本サービスのうち、閲覧は、本規約等に従う限り、どなたでも利用できますが、投稿を希望するユーザー及びアカウントの作成を希望するユーザーは、本規約等に同意の上、本サービス上から運営者の定める方法に従って利用登録を行う必要があります。
          </li>
          <li>
            前項の利用登録は、前項の利用登録の申請が運営者に到達することによって完了するものとします。ただし、当該ユーザーに以下の事由があると運営者が判断した場合、利用登録を承認せず、又は、事後的に利用登録を取り消すことがあります。この場合、運営者は、その理由について開示する義務を負わないものとします。
            <ol className="my-2 custom-number-list">
              <li>
                利用登録にあたって他人のメールアドレスを使用し、又は、虚偽の情報を届け出た場合
              </li>
              <li>
                本規約等に違反したことがあるユーザーによる利用登録である場合
              </li>
              <li>利用登録済みのユーザーからの新たな利用登録である場合</li>
              <li>ユーザーが１８歳未満の場合</li>
              <li>
                暴力団員、暴力団準構成員、総会屋、社会運動等標榜ゴロ、特殊知能暴力集団構成員その他これに準じる反社会的勢力の構成員（以下「反社会的勢力等」といいます。）であると判明した場合、又は、反社会的勢力等が経営に実質的に関与している法人の役員、従業員である等反社会的勢力等と何らかの関係を有していると判明した場合
              </li>
              <li>その他、運営者が利用登録を相当でないと判断した場合</li>
            </ol>
          </li>
          <li>
            第１項の利用登録は、必ず、利用登録を行おうとするユーザー本人が正確な情報を入力して行うものとし、誤った情報を入力したことにより損害等が生じた場合は、当該ユーザーが自ら責任を負い、運営者は責任を負わないものとします。
          </li>
          <li>
            登録ユーザーは、登録情報に変更があった場合、速やかに運営者の定める方法により当該変更事項を運営者に通知するものとし、登録ユーザーが当該通知を怠ったことにより登録ユーザーに不利益が生じたとしても、運営者は一切の責任を負いません。
          </li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">
          第４条（メールアドレス及びパスワードの管理）
        </h2>
        <ol className="list-decimal ml-4">
          <li>
            登録ユーザーは、利用登録が完了したメールアドレス及びパスワード（以下「本人確認情報」といいます。）を自己の責任において管理するものとします。
          </li>
          <li>
            ユーザーは、いかなる場合も、本人確認情報を第三者に譲渡し、又は貸与することはできません。本サービスにおいて、本人確認情報と一致するログインがあった場合には、当該本人確認情報を登録したユーザー自身による利用とみなします。
          </li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">第５条（本サービスの利用の停止等）</h2>
        <ol className="list-decimal ml-4">
          <li>
            運営者は、ユーザーが以下の各号のいずれかに該当すると判断した場合、事前の通知なく、本サービスの全部もしくは一部の利用の停止又はアクセスの拒否、利用登録の取消し、ユーザーに関連する投稿の全部もしくは一部の削除、その他本サービスの円滑な運営のために必要な措置（以下「利用停止等」といいます。）を講じることができるものとします。この場合、運営者は、当該ユーザーに対し、利用停止等を講じた理由を説明する義務を負わないものとします。なお、運営者は、ユーザーに以下の各号に該当する事由がないか確認するために、当該ユーザーに対する確認等を行うことができ、当該確認等が完了するまで、当該ユーザーに対して利用停止等の措置を講じることができるものとします。
            <ol className="my-2 custom-number-list">
              <li>法令に違反した場合</li>
              <li>本規約等に違反した場合</li>
              <li>登録した情報が他人の情報又は虚偽の情報であった場合</li>
              <li>
                登録した本人確認情報が既に登録されている本人確認情報と重複している場合
              </li>
              <li>登録したメールアドレス等を通じて連絡が取れない場合</li>
              <li>他のユーザーや第三者に不当に迷惑をかけた場合</li>
              <li>本サービスの円滑な運営を妨げた場合</li>
              <li>
                その他運営者が本サービスを利用するユーザーとして相応しくない行為を行ったと判断した場合
              </li>
            </ol>
          </li>
          <li>
            運営者は、前項の措置を受けたユーザーに対し、将来にわたって運営者が提供するサービス（本サービスを含みますがこれに限りません。）の利用及びアクセスを禁止することができるものとします。
          </li>
          <li>
            運営者は、本条の措置により生じるユーザーの損害について、一切の責任を負わないものとします。
          </li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">第６条（ユーザー登録の抹消）</h2>
        <p>
          登録ユーザーは、利用登録の抹消を希望する場合、運営者に対し、運営者所定の方式によって利用登録の抹消を希望する旨を通知するものとします。
        </p>
      </section>

      <section>
        <h2 className="font-bold my-2">第７条（投稿・編集について）</h2>
        <ol className="list-decimal ml-4">
          <li>
            投稿及び編集（以下「投稿等」といいます。）は、登録ユーザーのみが可能です。投稿等を希望するユーザーは、あらかじめ第３条の利用登録を完了しておく必要があります。
          </li>
          <li>
            投稿等したイラストは、他のユーザーが本規約等に抵触しない範囲で無償で閲覧することをあらかじめ承諾するものとします。
          </li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">第8条（閲覧について）</h2>
        <ol className="list-decimal ml-4">
          <li>閲覧は、本規約等に従う限り、どなたでも利用できます。</li>
          <li>
            本サービスは、投稿されたイラストをダウンロードして利用できるサービスではありません。投稿されたイラストをダウンロードすると、当該イラストを投稿したユーザーとの間でトラブル等が生じるおそれがありますので、ダウンロードは行ってはならないものとします。
          </li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">第９条（禁止行為）</h2>
        <p>
          ユーザーは、本サービスを利用するにあたり、次の各号に該当する行為を行ってはならないものとします。
        </p>
        <ol className="my-2 custom-number-list">
          <li>
            運営者、他のユーザー又は第三者の著作権をはじめとする知的財産権（以下「著作権等」といいます。）その他の権利利益を侵害する行為
          </li>
          <li>
            運営者又は第三者の名誉又は信用、肖像権、個人情報、プライバシーその他の権利利益を侵害する行為
          </li>
          <li>AI等の機械的な方法により生成されたイラスト等を投稿する行為</li>
          <li>
            本件サービスに投稿された他のユーザーのイラスト等の全部又は一部をAI等の技術開発のための学習データとして利用する行為
          </li>
          <li>
            ステルスマーケティング又はステルスマーケティングと疑われる行為
          </li>
          <li>
            以下の表現を含むイラスト等を投稿する行為
            <ul className="list-disc">
              <li>過度に暴力的な表現</li>
              <li>露骨な性的表現</li>
              <li>
                人種、国籍、信条、性別、社会的身分、門地等による差別につながる表現
              </li>
              <li>自殺、自傷行為、薬物乱用を誘引又は助長する表現</li>
              <li>その他反社会的な内容を含み他人に不快感を与える表現</li>
            </ul>
          </li>
          <li>
            以下の目的を含む行為
            <ul className="list-disc">
              <li>営業、宣伝、広告、勧誘その他営利を目的とする行為</li>
              <li>性行為やわいせつな行為を目的とする行為</li>
              <li>面識のない異性との出会いや交際を目的とする行為</li>
              <li>他のユーザーに対する嫌がらせや誹謗中傷を目的とする行為</li>
              <li>
                運営者、他のユーザー又は第三者に不利益、損害又は不快感を与えることを目的とする行為
              </li>
              <li>
                その他、TRPG用創作イラストの投稿以外を目的とする行為、又は、本サービスの趣旨にそぐわない行為
              </li>
            </ul>
          </li>
          <li>同一又は類似の投稿を複数回行う行為</li>
          <li>他のユーザーの迷惑となる行為</li>
          <li>運営者、他のユーザー又は第三者に成りすます行為</li>
          <li>不正アクセスをし、又はこれを試みる行為</li>
          <li>
            通常の範囲を超えて本サービスのサーバーに負荷をかける行為、又は、本サービスの運営やネットワーク・システムに支障を与える行為
          </li>
          <li>運営者の有する情報を不正に書き換え、又は消去する行為</li>
          <li>
            ウイルス等の有害なコンピュータプログラム等を送信又は掲載する行為
          </li>
          <li>公序良俗に反する行為</li>
          <li>
            法令もしくは本規約等に違反する行為、又は、運営者もしくは第三者の権利利益を侵害する行為
          </li>
          <li>前各号の行為を誘発又は助長する行為</li>
          <li>前各号のおそれのある行為</li>
          <li>その他、運営者が不適切と判断する行為</li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">第１０条（本サービスの提供の停止等）</h2>
        <ol className="list-decimal ml-4">
          <li>
            運営者は、以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部又は一部の提供を停止又は中断することができるものとします。
            <ol className="my-2 custom-number-list">
              <li>
                本サービスにかかるコンピュータ・システムの保守点検又は更新を行う場合
              </li>
              <li>
                地震、落雷、火災、停電又は天災等の不可抗力により、本サービスの提供が困難となった場合
              </li>
              <li>コンピュータ又は通信回線等が事故により停止した場合</li>
              <li>その他運営者が本サービスの提供が困難と判断した場合</li>
            </ol>
          </li>
          <li>
            運営者、本サービスの提供の停止又は中断により、ユーザー又は第三者が被ったいかなる不利益又は損害についても、一切の責任を負わないものとします。
          </li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">第１１条（著作権等）</h2>
        <ol className="list-decimal ml-4">
          <li>
            ユーザーは、自ら著作権等の必要な知的財産権（以下「著作権等」といいます。）を有するか、又は、必要な権利者の許諾を得たイラスト等に関してのみ投稿等することができるものとします。
          </li>
          <li>
            ユーザーが本サービスを利用して投稿等したイラスト等の著作権等については、当該ユーザーその他既存の権利者に留保されるものとします。ただし、運営者は、本サービスを利用して投稿等されたイラスト等について、本サービスの改良、品質の向上、又は不備の修正等、並びに、本サービスの周知宣伝等に必要な範囲で利用できるものとし、ユーザーは、この利用に関して著作者人格権を行使しないものとします。
          </li>
          <li>
            前項本文に定めるものを除き、本サービス及び本サービスに関連する一切の情報についての著作権等は、全て運営者又は運営者にその利用を許諾した権利者に帰属し、ユーザーは無断で複製、譲渡、貸与、翻訳、改変、転載、公衆送信（送信可能化を含みます。）、伝送、配布、出版、営業使用等をしてはならないものとします。
          </li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">第１２条（保証の否認及び免責事項）</h2>
        <ol className="list-decimal ml-4">
          <li>
            運営者は、本サービスに法律上又は事実上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
          </li>
          <li>
            本サービスに関連してユーザーに生じた損害について、当該損害が運営者の過失による債務不履行又は不法行為に起因するときは、運営者は、10万円を上限として責任を負うものとします。また、この場合であっても、当該損害のうち特別な事情から生じた損害（運営者又はユーザーが損害の発生を予見し得た場合を含みます。）については、運営者は一切の責任を負いません。ただし、運営者に故意又は重過失がある場合は、この限りではありません。
          </li>
          <li>
            運営者は、本サービスに関して、ユーザーと他のユーザー又は第三者との間において生じたトラブル等について一切責任を負いません。
          </li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">第１３条（サービス内容の変更等）</h2>
        <p>
          運営者は、ユーザーへの事前の告知をもって、本サービスの内容を変更、追加又は廃止することがあり、ユーザーはこれをあらかじめ承諾するものとします。
        </p>
      </section>

      <section>
        <h2 className="font-bold my-2">第１４条（利用規約の変更）</h2>
        <ol className="list-decimal ml-4">
          <li>
            運営者は、以下の場合には、ユーザーの個別の同意を要せず、本規約等を変更することができるものとします。
            <ol className="my-2 custom-number-list">
              <li>本規約の変更がユーザーの一般の利益に適合するとき。</li>
              <li>
                本規約の変更が本サービスの利用に係る契約の目的に反せず、かつ、変更の必要性、変更後の内容の相当性その他の変更に係る事情に照らして合理的なものであるとき。
              </li>
            </ol>
          </li>
          <li>
            前項により本規約等を変更するときは、運営者は、ユーザーに対し、あらかじめ本規約等を変更する旨及び変更後の本規約等の内容並びにその効力発生時期を周知します。
          </li>
        </ol>
      </section>

      <section>
        <h2 className="font-bold my-2">第１４条（個人情報の取扱い）</h2>
        <p>
          運営者は、本サービスの運営にあたって取得する個人情報については、別途定める「プライバシーポリシー」に従い、適切に取り扱うものとします。
        </p>
      </section>

      <section>
        <h2 className="font-bold my-2">第１５条（通知又は連絡）</h2>
        <p>
          ユーザーと運営者との間の通知又は連絡は、運営者の定める方法によって行うものとします。運営者は、ユーザーから、運営者が別途定める方式に従った変更の届出がない限り、現在登録されている連絡先が有効なものとみなして当該連絡先へ通知又は連絡を行い、これらは発信時にユーザーへ到達したものとみなします。
        </p>
      </section>

      <section>
        <h2 className="font-bold my-2">第１６条（権利義務の譲渡の禁止）</h2>
        <p>
          ユーザーは、運営者の書面による事前の承諾なく、本サービスの利用に係る契約上の地位又は本規約等に基づく権利もしくは義務を第三者に譲渡し、又は担保に供することはできません。
        </p>
      </section>

      <section>
        <h2 className="font-bold my-2">第１７条（準拠法・裁判管轄）</h2>
        <ol className="list-decimal ml-4">
          <li>本規約の解釈にあたっては、日本法を準拠法とします。</li>
          <li>
            本サービスに関して生じた一切の紛争は、長野地方裁判所を第一審の専属的合意管轄裁判所とします。
          </li>
        </ol>
      </section>
      <p>以上</p>
    </article>
  );
}
